# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\1_work\my_project\ws2812\psoc5lp\ws2812.cydsn\ws2812.cyprj
# Date: Mon, 19 Apr 2021 20:06:41 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 12.658227848101266 -waveform {0 6.32911392405063} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 12.658227848101266 -waveform {0 6.32911392405063} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 17 33} [list [get_pins {ClockBlock/dclk_glb_0}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for D:\1_work\my_project\ws2812\psoc5lp\ws2812.cydsn\TopDesign\TopDesign.cysch
# Project: D:\1_work\my_project\ws2812\psoc5lp\ws2812.cydsn\ws2812.cyprj
# Date: Mon, 19 Apr 2021 20:06:36 GMT
